[
  "obsidian-mind-map",
  "nldates-obsidian",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-emoji-toolbar",
  "url-into-selection",
  "better-word-count",
  "obsidian-admonition",
  "templater-obsidian",
  "calendar",
  "buttons",
  "quickadd",
  "obsidian-list-callouts",
  "fantasy-calendar",
  "dataview",
  "card-board",
  "heatmap-calendar",
  "obsidian-completr",
  "privacy-glasses",
  "execute-code",
  "markdown-prettifier",
  "table-editor-obsidian",
  "obsidian-diagrams-net",
  "obsidian-languagetool-plugin",
  "obsidian-icon-folder",
  "obsidian-textgenerator-plugin",
  "copilot",
  "obsidian-banners"
]